/*
 * 1) 단일 조건문은 여러개를 사용해도 처음부터 마지막 까지
 * 2) {}을 생략할때는 수행문장이 1개일 경우
ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ
		}
		if(a%5==0)
			System.out.println(a+"는 5의 배수");
		if(a%7==0)
			System.out.println(a+"는 7의 배수"); // if 뒤에는 ; 안씀                                                                                                                                                                                                                                                                                                                         );
	}

}
